"""
列表
1、基础级必做题


题目：删除如下列表中的"矮穷丑"，写出 2 种或以上方法：

info = ["yuze", 18, "男", "矮穷丑", ["高", "富", "帅"], True, None, "狼的眼睛是啥样的"]


题目：现在有一个列表 li2=[1，2，3，4，5]，

请通过相关的操作改成 li2 = [0，1，2，3，66，4，5，11，22，33]。



题目：下面列表定义正确的是 (A、C)

A. ['a' 'b' 'c']

B. [1:2:3]

C. [1,[],2.5,'a']



题目：有列表如下

ls = ['心蓝',18,['健身','妹子'],[['刘德华',56],['张学友',57]]]
请用列表索引的方式输出'妹子'

请用列表索引的方式输出'刘德华'



题目：有列表如下

ls = ['b','c']
请编写代码在ls的最后添加元素'd'，

请编写代码在ls的开头添加元素'a'



题目：有列表如下

ls = ['a','b','c']
请编写代码，删除元素'b'



题目：有列表如下

ls = ['心蓝',18,['健身','妹子'],[['刘德华',56],['张学友',57]]
请编写代码修改心蓝的不良爱好'妹子'为'阅读'





题目：有列表如下

ls = [2,1,3]
请编写代码对ls进行从大到小排序





题目：有列表如下

ls = ['我', '爱', '学', '习', '天', '天', '向', '上']
请编写代码将ls中的字符串元素拼接成字符串'我爱学习天天向上'





题目：简述元组与列表的区别



题目：有下面的代码

a = [[1,2,3],(4,5,6),7,8,9]
print(len(a))
输出正确的是：

A. 9

B. 3

C. 5

D. 4



题目（字符串和列表）：

利用下划线将列表li=["python","java","php"]的元素拼接成一个字符串，然后将所有字母转换为大写 PYTHON_JAVA_PHP





字典
1、基础级必做题


题目：下面关于字典的定义正确的是：

A. d = {1,}

B. d = {1,2:3,4}

C. d = {'name':'xinlan','age':18}

D. d = {[1,2]:[3,4],'age':18}



题目：请创建一个字典用来表示你自己的个人信息。有哪些key由你自己来决定 。







题目：使用字典和列表存储和操作以下数据

a. 某相亲节目需要获取你的个人信息(字典形式)，请存储你的：姓名、性别、年龄

b. 有一个人对你很感兴趣，平台需要您补足您的身高和联系方式；

c, 平台为了保护你的隐私，需要你删除你的联系方式；

d, 你为了取得更好的成绩，需要取一个花名，并修改自己的身高和其他你觉得需要改的信息。

e, 你进一步添加自己的兴趣，兴趣至少包含 3个(注意：兴趣是另外一个列表。请将这个列表作为一个成员，添加到原个人信息列表当中，添加到末尾即可。

"""

s = '0123456789'
print(s[7:3:1])